## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_mongo_collection.lagfest will be updated in-place
  ~ resource "azurerm_cosmosdb_mongo_collection" "lagfest" {
        id                     = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.DocumentDB/databaseAccounts/ruut-tf-cosmos-db-39756/mongodbDatabases/main/collections/ruut-lagfest"
        name                   = "ruut-lagfest"
        # (8 unchanged attributes hidden)

      - index {
          - keys   = [
              - "_id",
            ] -> null
          - unique = true -> null
        }
      + index {
          + keys   = [
              + "_id",
            ]
          + unique = false
        }
    }

  # module.function.azurerm_function_app_function.lagfest_signups will be created
  + resource "azurerm_function_app_function" "lagfest_signups" {
      + config_json          = jsonencode(
            {
              + bindings = [
                  + {
                      + authLevel = "anonymous"
                      + direction = "in"
                      + methods   = [
                          + "post",
                        ]
                      + name      = "req"
                      + route     = "lagfestSignup"
                      + type      = "httpTrigger"
                    },
                  + {
                      + direction = "out"
                      + name      = "$return"
                      + type      = "http"
                    },
                ]
            }
        )
      + config_url           = (known after apply)
      + enabled              = true
      + function_app_id      = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.Web/sites/ruut-backend-function-app"
      + id                   = (known after apply)
      + invocation_url       = (known after apply)
      + language             = "Python"
      + name                 = "lagfest-signups-function"
      + script_root_path_url = (known after apply)
      + script_url           = (known after apply)
      + secrets_file_url     = (known after apply)
      + test_data_url        = (known after apply)
      + url                  = (known after apply)

      + file {
          + content = <<-EOT
                import azure.functions as func
                import logging
                import pytz
                import json
                import re
                from datetime import datetime, timedelta
                
                app = func.FunctionApp(http_auth_level=func.AuthLevel.ANONYMOUS)
                func.HttpResponse.mimetype = 'application/json'
                func.HttpResponse.charset = 'utf-8'
                
                TZ = pytz.timezone("Europe/Helsinki")
                signup_start = TZ.localize(datetime(2024, 2, 15, 11))
                
                
                @app.route(route="lagfestSignup")
                def lagfestSignup(req: func.HttpRequest) -> func.HttpResponse:
                    now = datetime.now(tz=TZ)
                    logging.info(
                        f'Python HTTP trigger function processed a request. Time is {now}')
                
                    if now < signup_start:
                        logging.info('Returned 400 for too early submission')
                        message = json.dumps(
                            {"message": "Ilmoittautuminen ei ole viela auki", "retry": True})
                        return func.HttpResponse(body=message,
                                                 status_code=400)
                
                    try:
                        data = req.get_json()
                    except:
                        logging.info('Returned 400 for no data')
                        message = json.dumps(
                            {"message": "Et antanut mitaan tietoja", "retry": False})
                        return func.HttpResponse(body=message,
                                                 status_code=400)
                
                    if not data:
                        logging.info('Returned 400 for no data')
                        message = json.dumps(
                            {"message": "Et antanut mitaan tietoja", "retry": False})
                        return func.HttpResponse(body=message,
                                                 status_code=400)
                
                    form_fields = [
                        ("name", str),
                        ("email", str),
                        ("yell", str),
                        ("ticket", str),
                        ("gdpr", bool),
                    ]
                
                    s = [
                        field not in data or not isinstance(data[field], type)
                        for (field, type) in form_fields
                    ]
                
                    try:
                        data["gdpr"]
                    except:
                        logging.warning("no gdpr data")
                        message = json.dumps(
                            {"message": "Sinun tulee hyvaksya tietojen kasittely GDPRn mukaisesti, jotta voit ilmoittautua.", "retry": True})
                        return func.HttpResponse(body=message,
                                                 status_code=400)
                
                    if not data["gdpr"]:
                        logging.info('Returned 400 for no gdpr agreement')
                        message = json.dumps(
                            {"message": "Sinun tulee hyvaksya tietojen kasittely GDPRn mukaisesti, jotta voit ilmoittautua.", "retry": True})
                        return func.HttpResponse(body=message,
                                                 status_code=400)
                    try:
                        re.match(r"^.*@student.l(ut|ab).fi$", data["email"], flags=re.I)
                    except:
                        logging.warning("No valid email")
                        message = json.dumps(
                            {"message": "No valid email.", "retry": True})
                        return func.HttpResponse(body=message,
                                                 status_code=400)
                
                    if not re.match(r"^.*@student.l(ut|ab).fi$", data["email"], flags=re.I):
                        if now < signup_start + timedelta(hours=1):
                            logging.info('Returned 400 for too early for non student')
                            message = json.dumps(
                                {"message": 'Voit ilmoittautua vasta tuntia myohemmin, jos sähkopostisi ei ole muotoa "@student.lut.fi" tai "@student.lab.fi".', "retry": True})
                            return func.HttpResponse(body=message,
                                                     status_code=400)
                
                    signup = {}
                
                    for field, _ in form_fields:
                        if field in data:
                            signup[field] = data[field]
                
                    signup["time"] = datetime.now(tz=TZ)
                
                    logging.info(f"Successful submission for {data.get('name')}.")
                    message = json.dumps({"message": "Kiitos ilmoittautumisestasi!"})
                    return func.HttpResponse(body=message,
                                             status_code=400)
            EOT
          + name    = "function_app.py"
        }
      + file {
          + content = <<-EOT
                # DO NOT include azure-functions-worker in this file
                # The Python Worker is managed by Azure Functions platform
                # Manually managing azure-functions-worker may cause unexpected issues
                
                azure-functions
                pytz
            EOT
          + name    = "requirements.txt"
        }
      + file {
          + content = jsonencode(
                {
                  + extensionBundle = {
                      + id      = "Microsoft.Azure.Functions.ExtensionBundle"
                      + version = "[4.*, 5.0.0)"
                    }
                  + logging         = {
                      + applicationInsights = {
                          + samplingSettings = {
                              + excludedTypes = "Request"
                              + isEnabled     = true
                            }
                        }
                    }
                  + version         = "2.0"
                }
            )
          + name    = "host.json"
        }
    }

  # module.function.azurerm_linux_function_app.backend will be updated in-place
  ~ resource "azurerm_linux_function_app" "backend" {
      ~ app_settings                                   = {
          - "AzureWebJobsFeatureFlags" = "EnableWorkerIndexing" -> null
        }
        id                                             = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.Web/sites/ruut-backend-function-app"
        name                                           = "ruut-backend-function-app"
        tags                                           = {}
        # (27 unchanged attributes hidden)

      ~ site_config {
            # (23 unchanged attributes hidden)

          - cors {
              - allowed_origins     = [
                  - "https://portal.azure.com",
                ] -> null
              - support_credentials = true -> null
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>